<template>
  <v-row justify="center">
    <v-dialog
      v-model="dialog"
      scrollable
      max-width="600px"
    >
      <template v-slot:activator="{ on, attrs }">
        <v-btn
          style="background-color: #0d6efd;border: 1px solid #0d6efd;"
          dark
          class="mainWrapBtn"
          v-bind="attrs"
          v-on="on"
        >
          О проекте
        </v-btn>
      </template>
      <v-card>
        <v-card-title>
          О проекте
          <v-spacer></v-spacer>
          <v-icon @click="dialog = false">mdi-close</v-icon>
        </v-card-title>
        <v-divider></v-divider>
        <v-card-text style="padding: 20px 24px 10px;font-size: 15px;line-height: 1.6;">
            <p>
              С 1947 по 1953 года на территории Ямало-Ненецкого Автономного округа 
              силами заключенных ГУЛАГа проходило строительство части Трансполярной магистрали под номером 501.
              За это время были построены сотни киллометров железнодорожных путей и проложена телефонно-телеграфная линия.
              А для проживания заключенных каждые 7-12 км стояли лагеря.
              После смерти Сталина строительство было приостановлено, а уже построенные участки оказались заброшенными.
            </p>
            <p>
              Некоторые элементы той инфраструктуры стали объектами культурного наследия регионального значения.
              Другие поддерживаются силами волонтеров и государства.
            </p>
            <p>
              Однако многие объекты забыты. О них не только нет информации. 
              Отсутствуют даже координаты их расположения.
              Поэтому цель данного проекта: обнаружить как можно большее количество сохранившихся объектов,
              зафиксировать их координаты и текущее состояние. И нанести эту информацию на карту. 
              Карта является интерактивной: при нажатии на объект открывается его описание.
              На сегодняшний день осмотрена территория между Надым и Правохеттинским.
            </p>
            <p>
              Проект разработан <a href="https://t.me/history_501" target="_blank">сообществом "501-я в объективе"</a>.
            </p>
        </v-card-text>
      </v-card>
    </v-dialog>
  </v-row>
</template>

<script>
  export default {
    data () {
      return {
        dialog: false,
      }
    },
  }
</script>